In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('Preprocessed_Dataset.csv')

In [3]:
df.head()

,Unnamed: 0,category,comb
0,0,ENTERTAINMENT,"['smith', 'join', 'diplo', 'nicky', 'jam', '20..."
1,1,ENTERTAINMENT,"['hugh', 'grant', 'marry', 'first', 'time', 'a..."
2,2,ENTERTAINMENT,"['jim', 'carrey', 'blast', 'castrato', 'adam',..."
3,3,ENTERTAINMENT,"['julianna', 'margulies', 'use', 'donald', 'tr..."
4,4,ENTERTAINMENT,"['morgan', 'freeman', 'devastate', 'sexual', '..."

In [4]:
df.drop(columns=['Unnamed: 0'],inplace=True)

In [5]:
df

             category                                               comb
0       ENTERTAINMENT  ['smith', 'join', 'diplo', 'nicky', 'jam', '20...
1       ENTERTAINMENT  ['hugh', 'grant', 'marry', 'first', 'time', 'a...
2       ENTERTAINMENT  ['jim', 'carrey', 'blast', 'castrato', 'adam',...
3       ENTERTAINMENT  ['julianna', 'margulies', 'use', 'donald', 'tr...
4       ENTERTAINMENT  ['morgan', 'freeman', 'devastate', 'sexual', '...
...               ...                                                ...
78027          TRAVEL  ['tea', 'time', 'beneath', 'western', 'ghats',...
78028        WELLNESS  ['begin', 'surprise', 'advice', 'centenarian',...
78029  STYLE & BEAUTY  ['cheryl', 'tiegs', 'sauna', 'look', 'back', '...
78030   ENTERTAINMENT  ['sundance', 'icet', 'shade', 'american', 'rac...
78031   ENTERTAINMENT  ['girl', 'dragon', 'tattoo', 'india', 'release...

[78032 rows x 2 columns]

In [6]:
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.model_selection import train_test_split

X = df['comb']
y = df['category']

In [7]:
X

0        ['smith', 'join', 'diplo', 'nicky', 'jam', '20...
1        ['hugh', 'grant', 'marry', 'first', 'time', 'a...
2        ['jim', 'carrey', 'blast', 'castrato', 'adam',...
3        ['julianna', 'margulies', 'use', 'donald', 'tr...
4        ['morgan', 'freeman', 'devastate', 'sexual', '...
                               ...
78027    ['tea', 'time', 'beneath', 'western', 'ghats',...
78028    ['begin', 'surprise', 'advice', 'centenarian',...
78029    ['cheryl', 'tiegs', 'sauna', 'look', 'back', '...
78030    ['sundance', 'icet', 'shade', 'american', 'rac...
78031    ['girl', 'dragon', 'tattoo', 'india', 'release...
Name: comb, Length: 78032, dtype: object

In [8]:
y

0         ENTERTAINMENT
1         ENTERTAINMENT
2         ENTERTAINMENT
3         ENTERTAINMENT
4         ENTERTAINMENT
              ...
78027            TRAVEL
78028          WELLNESS
78029    STYLE & BEAUTY
78030     ENTERTAINMENT
78031     ENTERTAINMENT
Name: category, Length: 78032, dtype: object

In [9]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.33,random_state=42)

In [10]:
y_test

69034          WELLNESS
62848            TRAVEL
55120            TRAVEL
33829          POLITICS
72485            TRAVEL
              ...
66231          WELLNESS
13642          POLITICS
24199          POLITICS
21423     ENTERTAINMENT
48087    STYLE & BEAUTY
Name: category, Length: 25751, dtype: object

In [11]:
tfidf_vectorizer = TfidfVectorizer()

tfidf_vectorizer.fit_transform(df['comb'])

<78032x59830 sparse matrix of type '<class 'numpy.float64'>'
	with 1352842 stored elements in Compressed Sparse Row format>

In [12]:
train_feature_set=tfidf_vectorizer.transform(X_train)
test_feature_set=tfidf_vectorizer.transform(X_test)

In [13]:
train_feature_set

<52281x59830 sparse matrix of type '<class 'numpy.float64'>'
	with 906519 stored elements in Compressed Sparse Row format>

In [14]:
from sklearn.naive_bayes import MultinomialNB

In [15]:
mnb = MultinomialNB()
model = mnb.fit(train_feature_set,y_train)

In [16]:
from sklearn.metrics import accuracy_score

y_pred = mnb.predict(test_feature_set)
score = accuracy_score(y_test,y_pred)
score

0.8396567123606851